[
{"product_name": "HP Inc. Essential Laptop Computer 17.3\" HD+ Intel Core 8 GB memory; 256 GB SSD", "categories": "Laptops", "model_no": "N.A.", "Tcin_id": "92469343", "images": ["https://target.scene7.com/is/image/Target/GUEST_47ce3e25-12fe-437b-bd22-996b7b3a1c7e", "https://target.scene7.com/is/image/Target/GUEST_53e7204e-3540-4cb9-9557-4c16ad32d441", "https://target.scene7.com/is/image/Target/GUEST_f130a76e-8c2e-4ffb-93bf-c4140ef35f2d", "https://target.scene7.com/is/image/Target/GUEST_446814ad-8615-4d3f-9fe6-3ad16868bb33", "https://target.scene7.com/is/image/Target/GUEST_d0f6807b-151c-4a06-9d46-41f2197769ab", "https://target.scene7.com/is/image/Target/GUEST_8c0db99b-4016-4b99-a14e-be2da1eb000b"], "specification": ["Dimensions (Overall): .81 inches (H) x 10.15 inches (W) x 15.78 inches (D)", "Weight: 4.6 pounds", "Hard Drive Speed: No Rotation", "Electronics Condition: New", "Number of USB ports: 3", "Connection Type: USB", "Aspect Ratio: 16:9 Aspect Ratio", "Display Type: IPS Panel", "Industry or Government Certifications: Energy Star Certified", "Screen Resolution: 1600 x 900", "Wireless Technology: Wi-Fi 6E (IEEE 802.11ax)", "Data Storage Capacity: 256GB", "Data storage type: SSD (NVMe)", "Drive Type: No Optical Disc Drive", "Operating System: Windows 11 Home", "Primary use: Home", "Backlit Keyboard: No Backlit Keyboard", "Processor Type: Intel Core Ultra 7", "Microphone: Built-In Microphone", "Memory RAM Type: DDR4", "Touchscreen: No Touchscreen Display", "Maximum Battery Charge Life: 10 hours", "Processor model: Intel® Core™ 3 100U (up to 4.7 GHz with Intel® Turbo Boost Technology, 10 MB L3 cache, 6 cores, 8 threads)", "Processor Speed: 4.7 ghz", "System RAM: 8 gb", "Graphics card model: Intel Graphics", "Number of cores: 6", "Screen Size: 17.3 inches", "Battery: Required, Included", "Warranty: Multiple Warranties and/or Time Frames Apply. To obtain a copy of the manufacturer's or supplier's warranty for this item prior to purchasing the item, please call Target Guest Services at 1-800-591-3869"], "description": "Overview  - Elevate your experience with the HP 17.3 inch Laptop PC—crafted sustainably with recycled plastics, featuring an ergonomic lift-hinge, high-res screen, narrow bezel design, and a powerful Intel® Processor for eye-friendly, planet-conscious performance in a sleek package.    Features Power through the day with an Intel® Processor - Multitask with ease thanks to the powerful Intel® Processor, fast Wi-Fi technology and plenty of storage.  Breathe easy, we’ve got your back - With comforts like an enlarged click pad and HP Fast Charge, you can get back to creating, watching, doing.  See more, do more—comfortably - Enjoy the 17.3-inch diagonal high-res, narrow-bezel screen with lift-hinge keyboard for more natural typing.  Sustainable and forward-thinking design - Thoughtfully designed with recycled plastics and EPEAT® Gold registered and ENERGY STAR® Certified.    Software included  - ; Xbox Game Pass 1-month free trial; McAfee Online Protection 30-day trial  HP Support Assistant; HP Connection Optimizer; HP BIOS Protection; OMEN Gaming Hub; myHP   Disclaimers - Keyboard keycaps contain post-consumer recycled plastic. Percent of recycled materials contained in each component varies by product. Percentage of post-consumer recycled plastics contained in each component varies by product. - Multi-core is designed to improve performance of certain software products. Not all customers or software applications will necessarily benefit from use of this technology. Performance and clock frequency will vary depending on application workload and your hardware and software configurations. Intel’s numbering is not a measurement of higher performance. - Approximately 50% in 45 minutes. Recharges your battery up to 50% within 45 minutes when the system is off (using “shut down” command). Recommended for use with the HP adapter provided with the notebook, not recommended with a smaller capacity battery charger. After charging has reached 50% capacity, charging speed will return to normal speed. Charging time may vary +/-10% due to System tolerance. Available on select HP products.  - Based on U.S. EPEAT® registration according to IEEE 1680.1-2018 EPEAT®. EPEAT® status varies by country.  - Percentage of post-consumer recycled plastics contained in each component varies by product. - Not all features are available in all editions or versions of Windows. Systems may require upgraded and/or separately purchased hardware, drivers, software or BIOS update to take full advantage of Windows functionality. Windows is automatically updated and enabled. High speed internet and Microsoft account required. ISP fees may apply and additional requirements may apply over time for updates.  - The flicker-free capability eliminates screen flickering through integrating DC-dimming LED backlights. - High-definition+ (HD+) content is required to view HD+ images. - Percentage of ocean-bound plastic contained in each component varies by product. - Percentage of post-consumer recycled plastic contained in keycap varies by product. - Offer available worldwide (excluding China and embargoed countries or other countries identified as restricted by applicable law or regulation) to new and existing subscribers who are 18+.  The software is tied to the device and is not transferrable. If you would like to sign up for an auto-renewing subscription, you can provide your payment method at sign-up. By adding a payment method, your subscription will automatically renew at the then current rate on your renewal date until you cancel.  You can cancel your subscription anytime via your Adobe Account page or by contacting Customer Support. Please see current prices for  Adobe products available in this offer. Offer not available to Education, OEM, or volume licensing customers. Subject to availability where the recipient resides. Additional terms and conditions may apply", "variant": "N.A.", "price": 649.99, "discount_price": "$649.99", "sellers": "HP Official Store"}
]